
node = [2, 11, 19, 21, 22, 26, 27, 38, 42, 44, 46, 51, 56, 57, 58, 59, 60, 65, 67, 68, 69, 73, 76, 81, 85, 86, 88, 93, 94, 95, 96, 99, 100, 101, 103, 104, 110, 114, 116, 118, 125, 127, 128, 129, 130, 131, 132, 133, 134, 135, 137, 139,141, 142, 143, 147]
node_index = [2, 4, 6, 7, 11, 15, 16, 19, 20, 21, 22, 25, 26, 27, 28, 29, 30, 44, 45, 52, 53, 54, 56, 58, 65, 67, 68, 69, 73, 80, 81, 85, 89, 90, 93, 94, 95, 96, 99, 100, 101, 102, 103, 104, 116, 118, 119, 126, 127, 128, 130, 132, 139, 141, 142, 147]
node_56inner20 = [130, 68, 56, 2, 21, 100, 142, 116, 58, 132, 19, 95, 93, 89, 139, 27, 101, 96, 65, 69]
def sym(node):
    s = []
    sym_node = []
    for i in range(1, 75):
        if i in node:
            if i + 74 in node:
                s.append((i, i + 74))
                sym_node.append(i)
                sym_node.append(i + 74)
            else:
                s.append((i, 0))
        elif i + 74 in node:
            s.append((0, i + 74))
        else:
            s.append((0, 0))

    for i in s:
        print(i)

    # 选出来的56个节点里40个是互相对称的
    # 剩下16个

    print(len(sym_node))
    print([i for i in node if i not in sym_node])
    print(len(set(sym_node).intersection(set(node_index))))

# sym(node_index)
# Scale-1里有52个节点都是互相对称的，只有[2, 4, 69, 116]不对称
sym(node_56inner20)
# selected 里有40个节点互相对称，[38, 46, 81, 86, 88, 94, 99, 103, 104, 110, 114, 127, 128, 129, 135, 137]不对称
# 对称的里面是Scale-1的有29个 [2, 130, 132, 11, 139, 141, 142, 19, 147, 21, 22, 26, 27, 44, 56, 58, 65, 67, 68, 69, 73, 85, 93, 95, 96, 100, 101, 116, 118]
# 但2 69 116在Scale-1里不对称的在selected 里对称了

